# IsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlphanumericRevisionSettings..::..IsValid Method
AlphanumericRevisionSettings Class See Also
---
Determines whether the AlphanumericRevisionSettings object is in a valid state.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsValid()
```

Visual Basic
---
```text
Public Function IsValid As Boolean
```

Visual C++
---
```text
public:
bool IsValid()
```

# ### Return Value
True if the settings are valid.
# Remarks
The AlphanumericRevisionSettings should have at least one string in its revision numbering sequence.
# See Also
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace